[PAD]
[UNK]
[CLS]
[MASK]
[SEP]
3
0
4
7
8
9
10
129
137
5
48
22
26
18
17
13
14
31
80
51
20
37
12
42
15
66
16
50
19
39
74
94
36
38
241
134
1820
306
197
23
72
101
475
676
54
29
211
130
131
992
1790
81
61
63
73
388
24
79
1579
313
92
118
203
374
252
111
43
467
373
50999
46340
239
57
176
180
507
232
177
296
1721
179
78
1263
99
731
77
225
2795
460
112
286
108
48495
410
326
2441
240
205
141
957
287
21
285
44963
3151
147
47
71
182
119
689
1682
1270
1113
747
45
152
51157
125
183
559
762
900
245
424
173
1966
314
5170
27
340
695
98
3417
1874
250
160
76
400
1013
44
199
961
418
257
291
255
123
237
113
556
387
425
897
53
829
319
32
2579
1689
440
4929
450
1895
52
6705
503
1257
213
457
358
229
2143
336
135
196
256
691
641
528
234
920
60
366
5143
228
2880
167
362
62
158
328
462
100
727
778
1212
317
75
85
1314
161
1238
206
312
1085
294
1183
998
969
496
898
1400
3406
159
1016
696
580
3864
447
49
263
650
156
284
728
217
2963
564
4793
97
266
3608
923
1164
1898
276
605
3760
1370
55
28
794
188
126
251
4076
781
2185
151
680
7299
1044
1256
2972
2651
3211
575
568
671
7464
1485
423
330
474
702
826
2091
530
485
149
836
586
541
903
698
1847
1542
186
579
1401
402
478
850
1
1234
1470
174
827
448
1156
2095
880
40
574
3500
244
733
558
910
743
2830
1262
621
802
3453
583
1503
1077
3020
11688
1318
846
2061
3074
783
3352
5370
722
999
481
554
133
1141
452
681
1919
1703
1170
1989
443
155
35
278
338
672
2528
2408
763
1285
1134
1087
4689
842
323
58
805
139
1775
34
185
438
143
610
1254
166
713
1983
2272
436
1147
700
800
822
308
9535
121
941
249
701
68
595
704
966
654
2053
3488
1386
793
4018
1678
1569
628
537
1702
1111
9200
271
1076
1158
854
748
83
1480
2660
752
189
198
787
890
917
2
2995
124
395
1136
337
273
486
1159
2661
431
1580
667
810
624
10046
862
1651
2054
2530
1277
688
114
674
404
735
181
745
737
1644
833
943
103
190
983
84
1380
549
140
3201
1547
393
2125
332
195
360
591
1787
1389
93
1741
13120
1235
339
804
871
888
1293
1108
1050
1006
1003
2176
867
2102
1160
1797
8034
233
3751
4726
1018
115
1743
2595
1900
1295
543
1217
935
5363
13306
585
2209
909
1109
1105
422
293
908
1012
4941
1791
277
391
798
729
756
1143
718
401
720
426
892
258
1822
455
499
7995
384
598
150
948
1279
1184
242
1332
392
991
2253
281
3094
380
765
3237
973
905
1792
744
1695
4259
1342
1830
381
2146
3199
90
1443
717
472
534
3683
1972
2913
949
796
577
977
1131
304
329
813
1824
231
3704
4879
1871
1544
2265
619
864
2308
491
1699
372
1571
2057
2729
1998
2105
4063
102
1259
952
10144
532
8462
3658
5883
1037
631
1199
468
1977
1707
5729
469
355
761
1402
246
2103
1974
2126
3521
162
1296
725
7618
1073
4098
2704
2041
834
869
1022
978
1348
107
1967
1308
1245
2761
524
904
779
201
1383
2917
1994
2270
2034
1486
105
1247
1048
1488
557
5982
937
1173
1379
565
1102
1362
5626
1505
1286
5099
1509
412
96
3122
546
645
1730
1414
1635
1755
5598
780
10200
371
1327
1629
8433
2154
2753
1246
2051
1867
791
1393
320
3538
3632
914
678
4073
613
64
3756
435
272
377
331
3351
2789
165
670
703
685
2818
7732
1309
623
3364
10892
1049
6382
3855
261
345
1448
230
1394
1205
746
4649
1017
2998
620
4881
2524
132
4032
3616
947
769
91
1506
1090
8976
2326
1193
120
1079
622
477
542
883
370
4325
311
1014
316
505
344
2494
1415
525
891
1652
437
1125
1194
1660
2005
2298
625
545
1572
369
2582
578
3918
1060
5754
2361
235
4438
4533
4894
974
226
697
1287
1216
1799
46
1566
1224
136
325
1501
3055
335
1328
1421
223
3726
683
3141
290
1557
2402
1877
95
750
5865
1052
9941
498
860
3650
265
1938
4660
1606
1550
1200
3708
5298
153
1114
301
192
2922
946
856
3338
3360
2507
321
634
69
3738
2262
587
638
1026
2310
461
222
515
912
1378
1112
9917
2870
1617
771
2025
8044
597
608
740
5118
859
1356
8751
4624
626
3305
529
1121
7599
1659
353
2717
963
1831
1511
270
3451
2169
820
649
751
4060
1541
333
1718
792
5041
965
1901
1381
415
451
4555
601
1882
4038
397
7673
790
1195
5878
3498
495
835
1302
12923
1484
6870
1709
1956
218
138
612
2516
4529
1275
3034
1835
3548
2107
922
2746
324
193
1763
1432
1524
3834
814
11331
662
1513
2289
2517
6783
988
2899
6614
5153
2332
1935
1349
1613
1283
1403
1748
169
1618
538
1596
2236
473
1952
918
1144
566
1282
874
433
236
6205
821
1539
3914
1392
1518
1627
3311
1921
1261
1693
4362
146
4913
1933
1573
648
522
2036
906
5301
122
679
1116
2682
1092
855
2342
1837
2190
2017
8780
1620
1365
1975
1029
5389
3072
1516
994
4741
109
2089
4880
2555
3112
1814
359
88
848
144
976
972
893
1303
1594
6340
3032
3228
4136
913
2475
1469
1897
815
1698
7219
3084
2039
705
168
1826
3345
1118
2170
721
693
1360
420
5521
357
224
1175
2862
2085
739
1843
268
254
502
3490
2545
1825
3001
104
686
1715
2316
2932
2023
1490
1926
264
661
776
2416
3536
87
944
3354
1483
2602
1717
484
684
65
1353
3189
5130
3334
1317
453
2285
2295
1122
4419
1451
576
1543
3349
1810
1653
2112
1427
1597
2819
4332
509
288
7731
1626
927
1142
6419
959
2072
3380
1413
2219
16810
1351
1737
7262
2733
1946
2334
2235
14995
3665
1656
1106
1339
1442
1649
1575
1809
4402
1478
1531
3680
408
2656
5880
2306
267
282
7140
1803
3806
269
6467
1101
2016
1104
666
8927
816
512
2184
1789
1521
7138
279
1976
1027
1120
2348
4235
1067
1151
1529
569
41
809
8366
3150
1661
1988
7424
4488
2088
1807
4404
3679
2156
3487
9696
1555
5026
2740
3287
1239
2759
7059
3387
657
6966
220
1311
3728
1922
553
1452
3410
2911
1316
3068
4643
1669
1404
14210
9939
1047
10256
3985
1574
2141
432
9145
204
2811
11357
13741
1274
1628
647
1619
5126
5776
4415
2436
1885
3691
4520
2299
3554
4696
2452
260
4207
1497
430
2676
464
1165
2754
4771
2293
1560
5541
21011
1062
1716
2629
1827
3630
1458
1625
1032
5144
3495
2906
10106
2207
1213
1230
275
2599
476
764
1322
2142
953
2389
16860
911
4914
2192
8958
1198
2335
1416
364
738
3035
3701
3995
1347
2586
13653
1859
5120
7041
2836
2172
861
3075
2894
1135
7665
2097
417
1950
14519
2049
1385
6295
11037
2681
2561
5801
1537
6477
7568
845
1615
439
1117
797
1185
1585
4650
1530
352
7582
785
4543
1971
1271
1215
1945
5047
5475
315
1624
221
4814
5399
3912
1492
1965
6717
2197
1248
6724
2393
2501
2466
1210
1482
2950
2944
5174
1984
1391
1489
2350
3466
1152
1857
1341
406
1595
3629
4702
2234
8231
2210
1686
1223
2122
2433
1166
599
931
1674
303
1780
8079
3542
351
1913
1959
12576
342
4897
2188
2187
8925
1828
10107
6683
4698
7005
6505
1504
939
2940
11066
7827
442
901
2462
1672
13256
5403
3207
5413
3013
669
6232
280
2221
1728
3138
711
2780
3375
2301
2377
14678
6067
1040
1242
5415
3077
4117
7366
5543
6942
2328
734
1100
3446
1734
171
876
9426
5489
214
3408
7406
6123
14373
3688
2685
5740
3592
11493
4057
2297
1684
501
9964
493
1937
3100
1533
2099
4425
1357
1475
8105
9949
774
1433
2487
1444
8438
958
11173
3320
2375
2055
1229
3324
322
2401
2040
3568
1788
2238
4292
3135
1911
1441
3140
3039
184
817
1565
2202
2745
1431
2398
895
881
4785
4759
3778
376
853
2477
629
1329
1167
930
3056
2337
494
2955
3455
3043
3583
480
2284
2451
6444
2279
3851
547
513
3621
1540
10938
2807
382
3127
9352
2576
1036
1494
5867
5292
2292
1071
299
3837
2406
1410
4390
1665
1680
1024
2186
2573
1272
170
9711
492
839
1840
1064
1225
951
4962
7367
3840
1632
463
4182
6359
6009
5891
7601
1039
465
9680
2709
523
1806
3881
3505
1119
637
2287
2633
3668
1130
3769
11214
1140
1605
4108
1345
1094
5446
3619
3964
1801
2045
4463
12098
6171
5416
824
2529
6866
1777
444
1423
2031
673
207
3937
1208
4371
2098
421
1337
1395
3713
2903
1335
2167
2613
2237
3544
2027
86
3529
4638
3515
3177
4960
216
1546
2312
1868
10872
2697
5814
2153
2918
1648
3152
823
454
2158
4295
709
227
866
2093
885
539
3764
16026
17520
536
3314
5596
4828
1419
2539
2469
5431
3059
2600
2100
2007
12511
4162
812
2945
915
786
202
1057
2934
3275
5537
2486
8874
1878
1887
3792
3009
3454
3931
12343
1457
4012
2802
732
2902
1086
1535
3721
6536
2149
6404
6151
1436
4282
1638
5516
1829
1944
4203
2639
6309
2778
603
3595
1991
5846
5999
10680
3811
5113
128
390
208
8188
6696
2463
3418
4884
1028
3223
2484
2160
3378
4474
3702
712
2083
209
1655
2166
1993
2835
2848
1636
5194
1759
584
5291
2856
3832
7963
4123
2117
1616
25
6300
4974
4674
4065
1364
1534
2225
13514
3627
2540
3146
2048
13925
9619
4718
15607
3472
3018
1284
2876
2417
2833
2139
5959
10665
3210
3079
3251
2828
9249
3669
4907
3031
5195
302
2488
2891
770
10638
1662
1590
916
9653
646
3278
1093
615
2131
2565
2029
1676
2805
10505
555
1905
2592
1226
8311
11724
3930
2686
2804
2915
365
2032
3757
8340
1786
7418
2070
5276
3882
2245
730
2947
1564
212
1123
5501
6564
1552
12253
10254
4352
3164
3821
471
2696
3148
2399
6685
2664
5031
3073
4525
12580
8742
2909
2273
3715
3636
6988
3948
1929
482
831
1750
1800
2512
4316
5278
187
2984
1943
548
1925
4993
5686
8986
3045
13744
2454
11850
459
16093
4028
3144
13893
2161
1150
1355
993
2900
6299
8798
1097
10607
3367
767
4109
2772
4009
4541
12996
868
3754
929
801
982
4094
7165
1168
10449
289
4687
3204
1464
1602
690
363
4612
3534
3883
2563
3904
488
3004
7368
1459
1502
3307
11674
3809
2354
2970
5938
6159
6107
1323
511
6662
8100
3285
1206
3420
4090
8563
4682
3026
1510
3734
3925
942
4173
7379
1562
2898
7491
2087
2637
2533
3265
2315
758
1446
2593
2937
8147
1554
3205
857
15220
1815
1425
500
3092
1227
1011
2581
2435
1611
5937
2975
1607
527
955
6018
127
1252
5712
1222
3732
414
3010
3461
1567
8440
632
2797
12512
2747
429
9993
4782
3590
3369
5167
1045
3772
2927
8777
10898
7481
2278
4152
2106
4628
2766
10727
3344
3545
3506
2226
970
1241
1725
3166
6708
8521
2380
2695
327
13010
2018
3733
4054
1127
2239
4530
1551
1310
508
907
2060
1074
10030
1021
13055
3566
2578
2537
6725
989
2379
1657
2568
708
2511
1420
4284
3066
5365
1846
3707
1762
5226
5233
1368
3644
4605
3257
3368
5664
3064
2518
6682
2327
3491
2121
4779
4909
10816
8732
12106
12788
7578
2208
755
191
4000
3353
4953
3753
2134
873
82
3337
1969
2391
4659
2509
4471
348
4613
2404
1407
640
1727
2591
2774
2892
2974
4714
1912
1496
9934
5512
4220
3546
1180
2118
1031
1852
2858
8251
1023
6132
2532
2996
6693
5028
1312
653
996
2522
1251
699
847
8832
3263
11994
4417
4138
2716
9334
2439
2953
399
3098
5750
936
1201
3116
3555
5504
1738
1005
2572
3889
540
3033
4657
4082
1681
386
3219
2519
164
1612
2459
6687
2383
1191
2688
3175
12327
2720
3514
7131
1736
5004
2218
4983
5651
2674
1592
6711
5384
2165
6663
1477
4671
6617
7546
4134
925
175
2724
3022
1054
2822
2254
1232
3718
6056
3433
6228
3058
4750
2063
1515
7903
3239
1881
1430
1250
2604
1559
5536
3974
3569
4141
2414
3672
2787
2514
2204
818
3956
4303
7556
3448
6714
715
2611
3293
8472
6723
419
3613
3537
2497
9098
3489
4273
3673
13039
2138
2386
11880
2867
4290
1155
1888
6390
8846
7656
2874
14979
10503
1670
3561
1439
3494
6140
1821
1631
1600
1774
5858
5245
2815
1778
3395
2734
1128
2001
710
2863
844
4166
7291
11868
9559
1733
2513
4777
5024
1095
3214
3158
807
2059
563
2584
5049
1951
4609
659
3736
2605
16902
2008
3243
934
9362
4270
1434
385
1398
6126
772
3789
5957
13768
3096
6257
2286
3103
4092
1654
2912
1731
3720
4598
2961
2474
851
4093
5020
1178
9161
3317
5228
3012
3824
1894
4359
3928
2429
4639
4019
2631
4257
4479
5275
2113
4382
2359
3903
504
3423
2260
2883
3873
1214
1406
4728
2047
2667
3787
4381
5391
11197
7453
2264
2259
8520
1269
1340
2147
8596
3082
2959
2826
11887
3209
3780
4477
10769
1418
30
487
15416
2640
4917
1805
3895
1172
5631
20089
9202
300
15875
7287
5104
5335
5881
3952
658
2973
6575
4958
3457
8878
4448
15056
1696
3663
2625
2924
3532
4147
6344
4026
3218
6015
1752
1148
8242
12313
987
2320
3025
7075
2658
4744
1845
6025
6760
2376
3770
2124
1019
3432
2782
837
3612
1204
2174
4720
2817
2179
7567
4047
16201
5066
3885
5103
777
651
7308
1957
5046
9369
4191
3118
6787
2372
5116
1936
5591
4610
2816
1783
3905
1266
4360
2313
4161
3776
1747
6181
788
1325
3951
9329
3965
3136
11603
4717
6797
5184
3946
1811
694
15129
1466
6058
1374
15001
3477
9890
3117
1740
10809
14028
5364
8889
2317
581
2481
5574
5187
1869
4014
10205
1968
1481
3559
6822
3182
5035
2643
8385
607
3224
2323
2779
5716
3634
877
4865
4732
3823
1007
10024
1883
2670
1875
3501
2426
643
4834
4734
627
7132
3935
2907
1862
13960
3703
6074
3208
2499
13113
3128
1313
2552
3969
4823
3750
10661
4344
3541
6412
4636
2663
10085
1812
5582
3037
995
7770
2762
825
2410
1637
4841
1697
3413
2503
3274
2684
1377
4317
2033
3294
13812
6288
4167
4091
6156
2078
3838
2632
5086
1753
12048
9005
5366
1465
3963
926
5953
4222
20335
5911
2090
2624
283
10834
243
13337
4833
1258
2952
3749
2508
1623
1343
1570
2838
2930
2449
1853
4615
15685
2715
4056
1798
2550
2432
7907
1749
2669
8387
3856
2384
1633
3071
1169
3318
5125
248
3709
4036
5627
2646
2648
2763
3479
2587
3030
12724
1713
9579
3290
5530
1373
1221
5611
1319
964
4261
6730
4314
4848
5905
8471
4568
630
3396
2785
5943
5914
2111
1476
3343
15776
9774
1779
4859
5791
2775
5160
7182
3253
295
6529
1804
2908
4041
5309
1304
3359
6396
11353
5557
2796
7509
4326
6354
7681
4904
5181
6044
1982
4119
2871
4870
11648
12197
1361
1338
4611
1782
2231
3105
1773
6876
1964
2926
6632
3463
1816
616
3114
3145
2249
2291
4722
12843
3381
6161
849
3089
11286
4132
2338
2444
3024
3358
5247
2500
4908
292
6971
1893
3960
3389
3111
1264
4418
1297
318
2727
15662
2641
14733
3172
13954
2832
1107
2672
2821
2873
8760
5193
3006
5890
4781
3899
178
3299
6873
5570
656
3174
1720
6976
2120
3053
5624
5829
3645
9293
3814
3849
4464
3552
11076
16551
6292
2931
4433
4666
4547
15645
4860
3197
1281
2781
2038
4435
799
5146
6187
210
354
4819
1025
3040
3777
2374
7403
9450
7623
2844
11591
4614
5958
17056
6333
1832
3910
1463
1089
7499
1781
12288
14219
4796
10355
3238
633
6167
5726
4078
596
1163
2933
573
5054
3329
1940
3945
9097
3113
2897
8517
1063
5165
2884
12172
1359
2853
6821
570
17622
2990
2171
310
1153
1582
3860
8928
4829
5518
2845
4035
9764
5414
4486
3941
5752
5781
4864
1033
1690
4911
1043
2114
3464
4489
600
4135
10281
1650
1020
4478
13725
3471
6580
4053
1527
6753
5517
1124
6515
346
2177
12196
7559
7238
3450
2458
2635
4915
2896
3231
1367
2358
2597
7463
1276
3327
6996
15045
1865
3362
5106
8204
9548
7030
6319
14058
383
2288
3328
7328
5062
604
10441
2650
1126
3509
3654
3788
13601
4867
1244
3689
2067
1802
3761
16040
3178
754
11691
7174
5647
3638
6926
4784
6689
6847
5845
4669
4514
6722
5075
1536
13411
17398
1581
9180
8129
14259
5300
4024
2365
4430
3556
5784
3957
5464
13409
4089
4159
4383
1886
449
12142
12167
4767
2536
1176
3975
4075
3887
14221
1209
6545
9755
3949
4791
483
10472
1065
13081
3167
4716
1771
1157
4300
5158
2355
12492
8640
4497
968
592
5003
8624
6005
2104
10766
3106
3983
4798
7412
8112
3005
14583
6546
3765
1756
6498
2424
379
2920
5573
1986
3580
3926
1299
8871
2846
445
1273
7621
531
1576
6351
2357
2992
18476
9094
4740
4500
1646
5545
8930
6230
10031
4144
2557
2691
1010
5044
1772
9908
3081
11811
2956
9778
2069
10198
2616
13418
6593
2397
6626
571
7924
8922
3078
15083
1507
4244
6117
4177
611
5954
3416
954
6368
5731
4748
2626
3300
8151
7764
8091
3245
1987
4617
10422
3794
3817
2371
428
12135
6235
3095
8985
6592
3187
12123
4088
8963
6820
13910
5392
7710
6095
3526
6600
7435
11462
3977
3609
4641
5012
7252
3854
5773
4190
10325
3496
14403
4570
11521
12504
4890
2895
15509
7611
10088
5871
200
5818
4861
775
13974
2594
1548
3347
3336
4742
6062
642
1522
4882
3779
4981
5843
2551
6079
5382
14675
8047
3528
247
7563
4226
4764
5381
15894
2965
4042
5828
7747
1833
878
13340
497
8213
3898
3190
1336
4871
7237
3842
3234
7896
2276
7699
3261
3382
7796
5775
12883
2418
5684
5962
5110
3535
1879
3149
1203
1034
707
5531
1719
2982
5714
8028
506
3576
1253
3335
15076
18094
5678
6622
3216
5015
4770
3470
962
2730
2864
4338
6794
2275
3282
6198
2159
14949
4254
3023
2919
9012
8604
6093
11717
3906
1396
2791
4811
7674
3029
11175
5617
4701
2006
960
4470
1979
4927
9814
975
4988
6538
6839
9998
3038
3774
5692
2352
1970
4934
6527
12433
3656
2364
6884
1066
446
4769
5538
12274
4192
3786
5532
8165
14293
1658
8973
3841
5329
3859
4996
4560
9669
2841
3019
12344
8451
3795
8736
1578
4637
2985
4125
1739
4099
2687
1078
5618
5010
5460
4607
3419
10419
8250
2086
5171
2840
4453
1218
14379
7350
16137
3484
5735
3233
3188
2331
1855
7155
2395
4994
2464
5282
1948
2941
1839
4677
5578
10345
11511
7216
11022
7784
811
5351
5405
2601
2612
13508
3954
2978
1902
3763
3911
8221
16196
2887
3267
3202
2714
6803
5248
3429
11576
6828
1914
3924
5601
4491
706
309
6786
1941
7894
4025
3614
1069
2751
2588
2405
4187
7065
7281
3675
2428
572
5197
407
1146
12747
12521
4984
4460
1903
11732
2071
8886
8354
8435
5619
3333
2442
12407
3159
2467
2967
8284
8109
6894
6475
3625
2559
1961
4487
1622
6326
7408
5674
11397
1932
12235
11929
8377
2068
1909
4208
4170
2773
1850
3599
7927
1683
759
5511
11404
5221
4788
1891
1461
1512
4899
2340
409
8419
9744
2195
3877
5515
1397
10393
20687
10950
2741
2939
10190
18384
4061
2130
8062
1705
1556
5747
10405
808
7047
10904
5112
10308
15577
3640
2948
2504
4083
1673
2987
6650
3266
5267
6456
7895
1145
6223
5387
4743
4629
6197
3767
5490
5972
5027
2215
10237
2347
3735
8114
3269
9880
2680
4723
8819
6547
5227
5977
1447
10807
602
3373
4774
6349
13225
3486
7095
1467
2738
7013
1445
7056
5124
9211
5176
5216
361
4283
4310
2419
2872
3784
13666
6681
6064
1677
11321
3242
2585
5562
2647
17354
2938
6263
5407
4361
5341
6022
11704
7977
5094
12023
6049
5813
3517
3370
5756
7997
3994
3008
636
10544
7695
3752
2614
1053
4922
341
1330
3725
10425
7551
782
8935
2737
8895
2659
3979
11617
4214
2296
1417
259
12411
6623
5290
2839
6757
1487
10600
741
3820
2281
6566
3065
5795
8008
4268
5707
933
12312
6720
2708
4707
7187
9090
6078
10400
3857
4540
6789
9859
1171
10026
2434
1904
2115
2750
6638
560
10910
6077
15244
4681
8066
8738
3482
3366
5215
5189
4675
67
4400
5825
1545
13485
3798
3791
10318
5173
8686
3276
2726
7152
6201
4379
588
5266
606
1435
3441
10133
12651
18257
4579
8554
8741
7990
2302
5951
466
2541
15467
8186
8783
14341
14548
3048
4866
1211
154
5213
3386
5481
13095
3747
2510
2369
768
2269
6173
3892
11354
14626
8733
4685
3793
5681
1186
8689
9776
11818
5090
3342
6216
3879
4566
2879
14314
6544
4992
5056
5313
6099
6804
347
3090
9338
13189
13922
6864
11261
3540
9055
2893
4516
10082
11657
3011
2252
1162
5675
2742
5604
7850
9010
5048
4397
3876
3943
7765
8309
2971
519
11536
2544
2538
1980
5796
1197
3681
2248
7276
6581
10209
4427
1091
3440
3168
7443
5244
535
3173
5995
5718
11458
3533
5782
8864
11193
2964
9533
10694
13425
2636
11191
4758
1761
3719
1963
5936
7159
5630
5152
3571
723
1455
4085
5204
11452
194
4956
6502
10612
5761
15687
3139
2823
4746
2703
5986
5696
7190
2689
6910
865
4178
12206
11199
1426
4648
5093
5946
4050
2044
12335
8455
6909
6240
3698
10846
4813
5473
7168
8347
5100
5812
11687
7899
4126
2889
3646
4184
2653
3781
5949
13203
3240
9167
1424
7858
4999
4523
3637
15637
2493
18137
8710
5819
9028
4097
3513
5265
11956
11249
2012
5001
5733
5350
3170
3775
2628
4918
1870
13992
4521
9599
3061
4789
2082
4405
6165
3392
5419
5529
7842
3768
3154
5374
7743
4237
17191
8353
4562
3620
3695
1474
1154
3356
3724
4149
4646
12150
3374
13568
2011
8228
3816
4512
5868
5219
6310
14946
5797
5168
23179
6968
11934
6483
5887
7275
17727
4437
4705
7671
2203
5441
6081
12153
9837
12868
8292
10214
7547
5064
4961
4854
11446
3604
8705
9662
2958
3310
3818
2123
1694
9035
307
4751
4232
1785
6490
11385
6369
1331
3160
582
4154
5925
2043
2574
4033
6383
1294
2468
15433
6578
13625
4411
2829
9366
4559
6175
3104
4298
609
5347
3570
5772
17007
5983
3442
4926
7335
6882
6321
4413
10436
5645
2362
8035
6381
7333
3984
13219
5485
6072
3301
1098
1001
5580
3060
10038
1334
1795
4183
6214
3192
4826
5202
8877
5435
7923
5879
2002
4484
3936
9777
5680
6921
16433
2360
3697
15956
5507
16066
5251
2247
5719
4368
6759
11488
3110
15518
3249
458
9779
3306
2854
10165
3766
3504
819
3920
3893
8185
3897
3093
15609
16409
2056
3003
4016
456
3394
11612
7762
4199
3280
12808
4308
3511
10774
7935
1149
6091
4713
2199
2549
10290
13191
10859
7270
2916
5039
14912
5534
3283
6495
5690
8577
6785
4730
2290
3409
9896
3475
5339
9733
7297
7803
1307
5458
4601
4920
7934
1133
11540
8389
3553
5875
1399
2749
2074
1099
4986
2198
6234
4423
8241
4294
8838
4293
10669
10240
4017
10077
5302
2217
3959
7100
7503
4269
12922
6215
6417
16145
21435
6413
2777
3606
8049
981
3258
9909
8498
2181
11347
9246
6087
4546
5111
3163
6752
8122
3584
4198
2258
10311
12251
1598
1181
2994
2699
8315
4111
1588
8113
5409
5038
8244
3507
7792
5863
4565
15498
4985
7951
4787
4933
12316
3449
4692
16240
7055
6709
3866
10655
2769
1449
665
5453
4519
550
11341
4441
4817
4354
8069
1174
11332
4844
9139
6735
4422
5296
7189
4862
1437
9108
5123
4440
1182
4619
6013
7156
14251
8304
8778
4355
2311
2329
6712
11293
5237
9891
2227
7223
8097
7076
17373
4165
7365
773
5855
2129
8784
11960
10216
4757
3731
11739
6355
7572
1958
9031
4663
6453
5918
5687
3120
5730
4901
6206
9604
2527
3319
1179
11587
7652
9761
4891
7970
10647
16141
10298
6565
6912
3348
7261
6432
2455
5209
6202
6951
12822
6605
4910
4549
4504
724
5488
11786
8863
1500
6138
11432
5939
5037
10369
5941
10379
16197
5836
2813
8137
7585
2806
889
6534
2020
6982
10540
22284
2655
1757
5449
803
10130
5913
11421
3998
2168
3635
3660
2173
4003
5154
5535
2400
1514
3438
6603
14167
2101
7522
6840
6715
13525
4473
5087
17530
7309
7268
9925
7032
7607
6719
4258
5561
5725
3662
10189
4004
9373
5450
9391
7351
7596
15658
9039
4618
1708
9586
3508
5492
10336
4575
18861
1836
6846
3790
15346
1411
4051
13060
8609
3361
3917
4335
9942
10547
15839
3990
14755
1324
6291
6211
15701
2470
2000
4654
9276
3589
13624
7897
4756
2825
2981
14173
1884
5483
639
3439
14348
7785
6634
2710
5722
2163
8397
349
6092
6497
3288
14967
5052
13038
5615
4535
9282
16734
13197
2569
3550
5827
4175
7460
6388
3452
1746
882
3229
1428
1115
9285
8417
7111
7160
7965
4820
9309
12905
9931
12055
13898
10412
1990
9238
9169
1278
4719
5139
4374
6379
12777
3255
980
5835
4539
5706
9388
15057
9991
6284
3759
6726
5074
10621
2010
8267
1776
5246
14543
10269
4286
7205
9731
8779
6464
1908
971
2596
5252
13843
3643
1344
7303
8598
2445
3913
1996
9798
3916
15449
9166
3642
6521
4079
3067
18422
15047
3598
4762
2609
4215
2634
1268
2502
5931
7107
924
682
5236
7430
3398
5289
11569
997
5945
3727
8246
5629
9017
6200
12859
2808
10841
6059
1301
368
5314
8737
3986
2767
1927
2711
4005
2211
4095
7832
6429
6674
3271
8302
10543
14851
5297
9456
12128
2735
3711
10522
2850
3014
7278
6243
6416
4266
11711
3411
3700
3755
14185
7968
8427
9263
7775
6590
350
832
3623
5659
4120
1962
10629
7790
9735
11701
8880
5923
8265
1422
1744
5755
3198
7339
5380
5368
3865
11920
4594
9801
3069
6496
11970
10635
5930
17645
14150
4492
1610
5138
5007
8023
10098
1132
8048
4467
5713
11140
11131
8361
5765
8412
7634
16142
10654
4727
15660
3523
5242
4812
1813
5705
10957
6848
6282
1808
4567
2119
13069
7988
19223
6017
6857
4950
1706
10613
8022
6118
10926
5271
6504
1583
6707
10409
8141
5393
2394
7989
14688
3927
3953
5109
11129
5807
664
3474
2562
5749
5355
6567
5140
6535
6075
2490
11980
8405
10554
1587
6050
589
6855
5207
15834
10688
9153
9650
16678
8688
2378
4708
11051
6934
3850
14116
10487
9936
9824
6233
17167
4380
7295
13043
1599
3666
4451
8363
5117
7630
2294
4289
9182
6718
6656
5185
10751
4044
16114
5583
5128
7014
594
635
9672
15151
852
4313
7724
10789
12756
2857
12295
394
795
5665
7835
4576
6435
5283
5191
7811
4729
8192
9911
3601
7144
6469
5151
4973
1876
16911
1949
14278
3712
9849
5210
4305
298
2407
4102
12994
21876
13170
16974
6602
4792
2792
12380
8879
5960
3391
6225
8277
7773
2852
3652
6595
274
9995
7177
7348
11855
5757
10559
7605
3520
1038
2232
6594
9350
6389
5862
4357
3181
3942
16149
20038
521
2638
4825
12139
7088
9978
6024
18518
4573
18824
8631
5979
2834
9306
9128
7112
12950
7504
4406
4839
7520
5208
8567
8392
4509
5082
6459
1842
172
8317
3829
4580
15152
14180
6499
551
15665
6583
9546
2157
14732
4084
14980
15013
3997
4059
6782
742
4954
3372
6945
2523
11854
5699
4776
3891
3844
5638
12722
14515
9482
5572
13945
7685
21214
10877
2983
7318
2999
7184
6572
7358
3596
13127
11215
2936
6570
6995
11826
879
1577
6040
7913
5997
6051
1473
10064
8680
5343
6182
14421
6843
2617
4739
2440
4690
13148
2556
7852
3473
10572
21917
14677
4737
10346
7742
6166
3017
3512
14482
17965
2213
12797
5430
8960
8669
18866
3968
6830
4040
8531
9123
2713
3758
8271
789
6814
18454
15778
13022
9734
3232
15752
2702
5033
11283
9542
12921
1568
11825
4349
11478
8865
5367
6356
1231
4807
11141
4706
4029
5909
1872
6531
5326
16420
4153
15035
3165
11456
6596
10251
5147
3254
6311
6153
2692
7663
5590
8675
15245
4900
6002
2263
652
12147
1769
4801
2577
8479
6555
4874
1255
4557
10462
8825
5558
567
6445
4370
4228
12021
14457
4302
14456
5884
16672
7807
4868
3597
8236
12819
5935
2489
5498
5439
716
7825
9933
5398
2145
5261
7987
9462
3137
4341
8187
5743
2136
6556
3748
6989
19725
6385
1528
14939
6238
4551
3279
3696
5337
6920
12424
7176
4233
8179
3304
9130
9602
9392
3674
11945
6807
7064
7093
5985
3813
215
12269
10757
10663
9664
4256
6360
3284
6332
3785
2683
6217
5040
8550
12898
16063
10776
5620
5777
12467
5802
16234
2771
21706
4852
5928
4592
3080
8763
4008
8164
10140
11302
17870
4409
9224
5402
5260
8056
7239
2855
13651
4388
19294
5182
9066
22662
6559
5785
3988
838
5307
2679
14528
7010
1640
4524
990
17496
8002
8841
5745
6997
8138
4975
14224
6763
6414
489
1873
8475
9380
9045
3862
1471
8715
4202
3671
8299
4912
15814
1390
4238
8446
19993
5906
13785
11937
12726
6111
1354
5445
6472
5428
12615
9490
1321
6633
9977
13886
12534
4449
8281
12825
6010
5472
10051
3737
6192
2866
8313
4545
12278
7610
12183
2283
19048
3277
6260
4469
6628
8695
8642
6962
18278
3399
4528
4542
4442
3852
17069
5105
15710
4672
9400
3970
6012
2373
2050
1766
9560
4846
5085
4982
1243
9409
6147
23273
3923
14554
5141
1608
9623
12824
7280
4103
6135
5334
9494
8229
15519
10681
4695
3828
5277
6928
13591
8489
7485
7869
2812
13847
4621
14325
6372
9545
5098
4704
7272
4775
16415
8485
2942
9068
8483
8402
2849
5452
5294
15790
14330
4285
9341
9819
11870
6023
6162
8449
4378
14504
17497
3902
1999
7994
7391
5084
1030
11650
3586
10136
16048
8543
6465
3462
2065
21261
2196
13142
4176
8692
8077
10232
3799
14488
4194
11144
5885
1924
14360
2132
4146
8636
5922
14794
10770
5646
9592
6673
10187
5720
4550
10120
8815
17314
7823
5134
14123
518
4395
2206
14232
7209
6589
5274
11933
3547
13975
5854
6090
736
11503
9080
9773
9795
5279
5438
7002
4979
4124
8207
6599
12758
5050
668
7395
7317
10387
22468
7954
1009
7641
15368
9217
2851
9444
16444
6666
9654
4931
14190
4876
17655
5839
13495
17299
2356
5359
7392
4691
9631
8765
2748
2144
15487
5305
4446
3901
7161
12814
10690
10352
12426
12601
6653
13459
11875
4711
5956
2230
14714
4121
6336
3944
19277
8076
7130
5467
16467
7277
4015
13232
8249
13316
8345
5459
5811
8646
8789
10063
863
5837
7542
7677
5268
9149
4321
19524
6664
13814
6129
22500
5330
5070
6057
2175
5766
5778
2242
7313
5698
7500
11663
6631
4421
1384
4877
9239
4502
16986
886
3220
4511
4172
4339
1591
8734
9922
940
2666
3099
3363
3309
4216
16770
8500
10759
7292
6145
2261
8843
13752
13732
7083
11638
4067
2180
5009
6955
2135
1315
4856
6121
7213
1438
6769
10417
6512
13358
4888
15968
14470
7938
9527
12899
5342
8749
3869
9742
5344
11194
1352
6430
5179
5912
11483
7664
2075
4998
8067
6557
12144
7702
1866
5273
11593
10320
5519
1382
3822
5900
8429
2077
17805
9177
4304
19684
1517
12035
18150
5243
3938
3046
7537
875
7960
1498
7506
9273
4137
590
6402
8434
9796
4584
9387
5734
8430
2460
10297
16440
2073
14869
9847
9767
5635
3573
2026
2827
6983
6582
14642
3874
3236
5285
8416
1745
4062
5386
4971
8116
1366
2723
4275
15554
7229
3939
12636
4600
7700
10722
3447
16640
2598
7888
11103
4287
11943
3325
4935
12579
8220
2300
7332
6484
1889
10236
14025
3126
12232
14464
6177
2505
5607
1072
5476
4429
3054
3147
8641
8197
5614
6045
13539
7490
1070
4963
784
4889
10466
950
5348
11309
12834
8484
56
16841
1978
7134
4048
7632
10074
11697
12891
2642
11369
6267
15290
8530
6353
5013
6697
10749
1864
3657
10974
2677
2246
5658
9475
5859
16068
5662
8792
7519
3051
6835
11205
10741
5256
5568
13155
10662
8694
7082
1701
4658
2035
1042
11893
4231
1675
919
12415
4020
8980
4836
7533
12826
552
434
4505
16684
8583
5045
7143
5426
9406
12683
3264
3782
2224
2498
4212
17182
11999
3676
766
6037
6837
10672
11269
2140
6619
16496
3922
8356
4432
3357
6278
9251
3087
2339
13490
9038
6777
9526
6184
3217
4668
1794
9376
5059
6088
6144
7115
8502
2030
6108
6584
12025
15452
16385
5474
4130
5149
6250
8707
9189
15544
4046
6183
1376
9787
9781
1663
12248
9883
3835
12245
10053
2553
6020
11690
20813
7343
5806
10006
11877
4738
6919
6174
10415
10644
9030
7937
11244
7051
10598
4072
4536
4987
10566
3153
3331
3195
9113
10744
5362
11349
16881
8155
4386
8851
12002
10115
5312
2547
5091
7231
5748
2240
11071
1188
11394
12787
11965
3044
4684
16560
8344
5803
6660
12505
3124
16745
6308
14703
4248
1939
4377
6745
7372
3405
5679
1621
6069
13087
7293
15820
4633
11692
17751
5175
8375
6400
3129
7535
6806
6925
13381
13309
6488
5834
4821
3996
13667
12940
3819
14200
11489
9736
7608
7909
4850
26694
5332
5107
7263
6961
1508
403
15911
12751
14417
15711
5571
11574
6071
7349
8708
13415
7218
11243
6950
9364
11549
16828
11991
3431
12225
3692
13636
15560
10636
14942
21018
3422
15204
10199
1405
6277
11715
14573
6661
3171
6307
1289
12832
11021
1641
5520
6960
10211
10392
6122
9016
3193
9889
7653
11580
10747
6458
5669
2757
4883
6896
8615
3465
12744
6863
1995
5889
6620
3615
1525
14804
18235
16944
2346
6788
375
5952
5569
7849
6503
9809
15068
13470
3729
7838
9413
11814
10556
9788
4196
5603
8573
21034
3050
2062
15559
17268
9509
3686
13355
14264
9595
1726
13308
13102
7357
8569
9292
1220
5069
9959
2194
9983
19451
10948
6256
14840
1219
12587
10302
10434
14448
8310
7074
12607
8359
3000
16700
14617
6833
938
1387
6219
4493
8654
9519
15347
11552
7199
12495
8955
13855
9573
3827
4337
562
6923
6762
6447
10471
9803
9971
1589
7169
9279
6690
12779
15333
9817
9481
6083
9134
16221
5798
14667
5164
8189
6506
11743
4582
15445
6986
10909
8327
760
10907
8667
7755
4336
10058
8115
14639
13932
9021
4115
7193
2705
5608
9698
8590
7795
7399
6636
2567
9131
10149
7945
6082
2321
8297
2860
20714
677
10037
14466
11832
5688
14169
9164
11577
21503
9037
6991
7620
8767
10131
14459
6335
11760
5437
6163
8999
10714
14395
8142
21015
5327
9227
5002
9989
16384
2182
16795
5652
5702
986
9132
12448
7260
19688
16111
4229
14067
8920
11064
15313
4322
11606
2542
11439
16182
4635
9723
7319
12125
828
10738
7027
6180
7528
5029
6885
4158
2014
10958
29922
8343
4058
5432
11117
13563
3180
3801
6994
3015
12145
13064
20074
1000
5760
14841
13088
4309
11264
4408
1298
5379
2214
7337
3483
7017
8263
5214
6542
4281
8766
843
6523
10178
12723
3132
3183
1899
5238
11660
12164
4195
5060
10080
10022
6157
5644
5338
8653
3746
5970
10775
3519
17216
9140
11874
15186
1601
11484
5306
8191
6471
1350
7900
2268
10159
9213
7286
8082
2564
7341
2744
14743
7472
11112
13289
12119
5609
13349
1233
4143
7454
3783
10984
6838
10208
7999
10931
9974
10563
7371
1192
4105
2421
11954
11672
3971
14334
9624
2277
5067
7538
4456
2788
6836
2319
8285
4074
9336
14458
11433
5673
14425
3684
20450
5933
11987
15295
11924
4587
7961
2425
12916
14511
13844
11718
7329
11721
16138
5133
10593
14648
5894
10718
8974
9502
7025
7073
27978
10864
6698
6861
4296
11764
12052
10203
6097
7854
396
7914
5767
11108
2392
10912
10334
7040
7289
5759
9335
11644
8175
6255
2472
4709
13852
4366
6541
2403
14059
6931
11597
12166
9457
7861
4494
10686
12577
4482
416
10619
10579
3235
9691
10191
1080
9895
5328
2363
11162
6486
13463
12987
116
7369
6160
11454
14486
2094
6350
6039
6948
8474
10095
2028
10739
6060
389
7226
7474
12179
4532
7397
5968
7497
9603
9242
8664
23279
6141
5903
2220
3083
7847
10567
9445
13961
4800
4262
12414
12895
15249
9267
7679
8950
10279
5436
4665
9898
967
5270
1918
11045
12820
11894
2128
1880
5340
4853
11061
8937
16320
9813
3605
510
1931
15144
9897
14342
1008
11247
16077
8443
4439
7779
10703
15196
18883
4989
11747
7389
10402
12477
18289
2351
4715
2052
10899
13408
9223
2946
10946
12509
3549
2885
8254
533
9384
6791
12555
21405
11028
7456
6514
1462
6569
16260
12364
16110
12680
9770
8136
10537
8897
219
7449
7063
2471
14654
7136
8283
10406
12165
12045
2076
10228
7301
894
1634
7387
12535
6154
10437
12530
5964
2607
4804
8201
9191
14146
5079
14337
15154
9807
14092
1700
12954
2515
13056
7837
6283
1260
11003
3437
4179
10206
12455
106
899
7322
4034
4943
12208
14206
12184
13216
6829
8300
8058
5666
20330
14811
10246
10943
5826
1863
14767
2803
14792
5447
12429
4703
6222
2191
7709
11431
12416
12060
2148
1630
12008
12356
9076
12514
13445
17454
7254
8529
9948
9790
8524
11211
12446
15211
10733
1729
12952
985
2178
5621
18109
2991
9674
2353
6317
7487
5071
10706
8391
11773
6927
6539
7345
7627
6668
5121
7098
14005
5361
6347
12064
3993
14640
8772
2928
1051
10970
4239
7407
6297
11159
10648
1593
7475
19006
1280
13583
15255
7438
6561
11272
8007
1714
2671
4976
6610
14924
15375
1305
15479
8575
10457
6551
470
5373
8820
9957
11221
23410
16846
6450
13958
2343
14899
1523
3516
9712
6887
8954
4957
7446
2675
11498
7050
726
11158
7575
2437
9956
8055
4454
3480
8358
13801
19670
7654
9484
5654
13761
2768
14850
7815
12315
10801
6881
1934
10354
10508
5597
8038
12598
5053
6658
14553
4301
10010
2765
3273
520
14584
7459
9281
5575
3142
12600
13499
4197
12199
11515
4171
15471
1642
14294
18398
3831
3313
6672
11169
11180
5253
6492
10954
14789
3028
14333
12428
6070
12174
6279
5272
7566
5898
13188
13448
8702
12437
16269
3206
16643
10625
3743
14230
6737
14081
8193
6648
6647
16657
12563
15361
3742
8681
9015
5779
5815
11090
12096
4569
11466
2330
7029
8096
12520
6500
13372
6815
2411
145
7738
4824
6016
4392
10391
9609
19785
5457
4667
3415
9555
7581
2461
16668
17039
10217
11395
7570
8118
6868
10838
1346
13682
18138
3602
12355
10584
11578
10949
11649
6405
3962
8123
4129
13046
14064
9929
8883
9857
10011
11944
8478
16588
7725
16744
3225
16360
3393
10083
9985
4561
9344
11477
5186
6391
7971
10056
10857
6422
8584
2366
16852
8128
14582
1129
10212
10763
14875
2388
11104
6702
11485
1854
15492
2324
17967
7429
11276
2820
11624
8740
4481
9365
4052
13161
13604
4978
10282
15141
14656
1639
13694
1110
10303
4842
16350
7507
9307
9433
10520
7767
7555
9483
13464
9563
12094
13143
8172
9638
14823
7809
13951
1189
2303
7273
7087
11403
8465
6510
4964
6932
21361
12445
7039
5388
11775
8552
1973
11257
6970
9496
3867
12547
3812
14298
10069
4583
1930
1735
5546
4483
10525
1236
7830
10333
9928
3185
16980
12761
14964
10881
1742
10513
7655
3157
11777
11737
8589
8975
14386
8545
12181
13323
7876
11522
2693
5824
10709
11953
12821
12712
14250
16431
7342
4311
6947
2037
2015
13402
17025
7639
3426
9299
4655
5742
6190
2764
4080
9451
5559
5524
7338
9357
7148
8555
9976
13985
4163
18955
3800
19392
984
11118
4241
10998
7001
3076
2212
8885
9333
4424
7340
5016
8814
5622
2305
3298
6655
4160
12390
8513
1955
11986
4586
1704
8287
10848
7580
12227
13494
3215
11424
2267
5724
4651
13013
8208
15085
1915
6585
14834
1468
9416
6917
6011
5022
11529
13598
17548
3121
8131
4393
12339
14724
4265
8729
3493
8491
7955
8010
8380
14011
7224
9684
4588
7200
10990
14857
22579
2318
9300
13991
6149
7791
16487
5131
8253
6224
16005
6248
8040
9231
14450
5830
7227
10699
5770
7214
30612
12368
7834
9193
8255
9492
6303
15992
10679
15618
12793
9463
14285
11838
8515
9820
16448
6365
10553
4156
13896
13938
8275
3808
4476
16695
11919
544
5640
4288
13053
4670
1671
9564
5249
6006
5893
6285
12058
16625
13348
12200
8210
3872
7672
9497
4420
14125
8052
14726
4436
5820
5034
24056
18417
9947
1722
3221
4110
11337
12531
3227
5323
6576
9358
9114
4948
4385
5322
7145
11851
3241
7552
3123
22443
4626
3102
6178
7676
5089
5632
16393
10552
10103
13634
5451
14659
7860
10221
5346
8506
13857
5319
8745
9022
10833
7133
7264
5097
10084
15137
12799
7577
8195
3428
4855
6055
9714
10328
5032
9310
11086
6930
6199
7788
8797
921
8399
8230
11111
10494
8833
10886
6721
4895
6747
3434
6000
5420
12634
6938
2064
7094
5586
12586
8349
5021
13129
6577
6033
6819
11358
7539
17076
9858
25878
6048
9009
12813
12888
10726
1760
8648
5234
14054
870
10068
9168
12879
19233
8161
2446
14072
8499
1981
6625
4252
18163
10027
23045
70
1068
3341
9679
14506
858
14234
15517
17285
8910
12450
6765
6784
22842
8420
17922
9056
4810
10015
4350
2066
841
14684
6027
11012
1495
13541
9402
8338
1765
10643
9852
22022
20019
6124
4680
9659
1754
11605
7374
10571
6643
10375
8869
6641
8753
10824
13406
8722
14228
3250
3667
14340
9888
14532
9600
9881
15631
479
6916
17925
9937
13390
1363
14906
4563
12120
7670
8574
20444
10850
4590
5487
2423
2150
7361
3196
956
12369
19226
7821
2954
8218
12870
14538
1055
11628
6208
2495
4930
7364
14399
3308
8376
10330
10075
10530
22340
9794
8943
11727
14641
6657
9811
3444
15769
9750
8382
2621
7643
13322
1758
9850
7818
6543
9561
15800
14699
11125
12930
9938
14539
11769
12816
8774
8156
3222
5595
18227
10261
12230
1553
10059
9356
3687
10753
12124
19911
9002
7584
12122
7513
12671
13472
14999
18167
14881
7625
9642
6029
13468
3802
6329
12044
21404
13187
15236
4307
6195
7527
10327
9215
6761
9206
14170
10138
11336
16693
14983
8393
10790
14507
7865
15048
10034
13540
11867
11908
8329
6975
5433
6380
10148
15131
1849
12755
21676
7840
11355
14284
4096
4414
12593
3560
7633
16945
5455
7360
2483
1985
2882
4921
3303
7933
17724
12256
7135
13476
5196
16557
9656
12878
25412
1712
8643
9404
2810
5697
13515
12222
8839
9154
7423
8991
12072
4462
7690
11782
9514
1992
3119
10210
10847
7444
9962
3921
15840
7079
5602
15605
3252
9150
10551
6341
11386
6642
7780
9697
17169
6302
15153
7867
9870
11798
5613
1928
6063
9700
11222
9347
1724
7257
16661
2752
5701
13226
20431
6482
3641
6480
12627
9616
12786
10373
5136
6841
10891
9199
11940
7421
16430
7794
8861
18302
12483
7191
14696
12080
8902
8326
4251
11895
8071
7053
13674
2904
9954
8029
11592
4329
9274
13860
5838
11871
8994
13384
26632
14909
9676
10596
6903
3577
13936
4783
11328
11449
6068
9789
14279
17490
15317
1526
13489
10901
2535
7401
5471
7447
367
4642
9317
2244
6280
9330
4795
5421
4936
8844
14762
10122
7808
15173
4070
6096
11816
20736
4387
11196
19660
5605
11984
9606
12216
4534
18799
12458
4412
3611
2205
17070
5533
9448
3628
1892
6193
7919
11792
6421
7103
11457
238
15767
15378
4403
11267
7398
13890
7344
18060
2627
17742
18500
15566
12572
8274
3101
5872
3200
10397
10687
12093
4840
1440
14308
8657
5873
10446
8979
5633
8370
4721
6301
12085
20412
25685
12149
6552
10561
4250
11964
8786
7393
12306
14520
9935
7448
13350
9905
11509
14954
334
12840
20842
8893
19566
9354
7302
20675
12795
11709
12357
16858
6533
6474
9124
11720
7831
8396
13856
12867
13357
4280
1096
3915
12685
4230
4001
4346
14164
7409
6549
11829
13550
3203
3649
16191
13054
12195
2021
9397
5732
8845
14453
5043
4112
13319
11946
8194
3246
6403
8888
14077
8629
7139
5753
7950
5198
3804
6645
1388
10389
6914
5542
5115
1953
4616
14345
18608
8273
10560
11949
16638
8501
10589
2606
11915
9585
5161
12546
3109
12759
7741
12711
7259
2654
7195
15248
13530
6749
11268
2925
6481
3981
11317
9447
10338
9580
11464
8145
13929
18177
3047
5434
12014
5992
4077
16687
22064
9359
10492
5324
8512
9683
9360
2200
4376
7084
7777
4023
23090
12673
1137
13546
5792
16107
6825
8078
4168
10988
21798
11254
5172
4513
10362
12745
5286
9175
3316
8059
9155
14578
12519
9783
10253
12705
13664
12969
13325
6451
20196
10394
12009
6710
5844
2977
4710
11151
14713
16015
12942
11736
12155
4356
11005
11393
9833
2080
16576
8043
490
14606
4081
5980
12473
6258
13242
6739
7540
6558
5948
11527
8660
8923
10761
7478
7007
8511
11700
8964
10484
10112
1558
4763
3610
14625
7000
9556
10164
15190
8771
3932
5061
15108
13335
2718
12838
8436
7019
11096
3281
7749
1784
7476
3063
10939
8699
12989
2618
9702
8032
5375
7222
7595
19351
1920
11774
13255
5780
15339
6772
15828
14566
5269
17077
8158
12417
15148
11314
14603
10762
20134
10812
13738
10575
6854
7962
14085
14697
2448
15849
13492
12131
12715
6756
5019
4022
10160
14126
11805
11121
14419
14982
3427
15724
6845
7162
6898
6936
4485
9829
12929
15972
11556
16554
29742
6793
7296
13972
7810
12746
9727
5966
4274
7426
5787
13336
9681
16829
4527
15999
3690
16989
11513
10532
14537
7300
4107
2274
8135
16681
12384
5987
11410
3677
10314
11049
1856
6767
10701
3682
3871
10100
6316
18037
8516
9854
5657
11583
8881
14594
4548
10640
15822
5840
11526
14904
7644
8290
12752
9216
13644
11550
1817
14672
16586
8704
9775
5927
4747
4426
14272
7943
15351
20115
4007
11469
5308
7077
5229
10025
10465
4277
15905
11822
4608
6266
687
13375
13284
14833
9826
1823
10604
4113
19578
17424
2988
7991
297
14756
8560
14996
6116
15261
5741
6736
7660
8716
13566
3162
8037
15909
8468
14598
11562
4234
9296
8854
3973
9841
2450
14239
2409
9264
10163
16428
14914
9118
7893
8850
8017
14666
13441
2878
6611
5055
10597
12864
5606
6036
12609
11903
5848
2479
20295
14749
10602
9968
12499
13251
5973
13506
10370
16101
1083
4951
14182
3384
17388
7493
7479
8676
6518
10421
14377
4694
7561
19872
3653
5831
14006
8723
15738
19057
15563
7746
6805
7517
4157
5358
10835
10917
7230
9184
11147
15815
2809
15178
7285
6844
11500
9756
7756
4699
7436
8606
4735
13066
15288
9084
3805
4150
16964
19686
6692
15352
1288
16231
12383
17078
8565
5821
11547
10377
3340
5224
15168
14108
6525
9079
5810
9348
9474
10454
18389
6194
9214
13528
8493
1409
12791
6374
15678
13035
3886
5924
8793
23376
8086
6489
9431
11291
5744
3884
2706
12770
4452
16783
13141
3460
12682
15473
1249
9544
7979
6434
10888
11499
10819
11541
20053
5162
10564
13004
12926
7593
8445
8171
13052
1412
945
12719
4803
11383
15461
11473
6030
16354
9701
10174
7661
8898
17047
14892
5311
7882
16874
10125
6106
13364
8621
7642
15927
6357
7022
13629
3443
17682
11654
15397
5916
12805
4554
14186
5424
4662
8674
13311
13253
3617
11014
17758
10343
17269
6727
2790
12273
9326
10691
11794
13354
6939
5478
11616
5643
10404
8566
15210
4851
15935
5404
13687
20217
9479
14512
7565
1177
11148
5479
1614
4959
6612
10569
5588
8004
7201
5042
5886
17446
4319
11351
13237
20428
8045
896
9716
9270
7015
902
14816
11809
14739
7492
8357
15453
14007
13473
4581
31087
4066
8949
16007
14003
12617
3226
8170
4223
6597
10851
11763
11637
6774
2662
10583
7548
17658
8084
4267
11263
11505
6676
10539
8206
12489
6716
16907
22951
3875
11427
10070
2096
10294
9143
11810
14781
6104
17573
12957
8538
6102
12211
10683
12286
9339
8773
4977
9639
6893
15906
6699
11910
13710
7221
2084
13429
11905
3143
10124
10829
4106
2905
7175
18768
14753
11060
2193
12573
9460
12046
7151
2570
22776
4055
18063
5788
13758
11772
15766
7783
8630
11242
7598
9845
5192
10811
13267
12332
4318
1796
4373
7614
12527
8252
5764
14734
13967
663
11601
3967
8346
15782
10707
17799
6946
1075
5976
13297
11608
14220
6289
3414
7839
18370
4589
18962
7701
10696
15808
7480
9086
10413
13953
13329
7279
4443
10248
3847
13412
9686
13880
9152
11306
6103
10152
8788
16997
7288
15260
15973
12650
11079
13130
1035
23365
5357
23347
14104
12963
10111
9023
7068
20260
14127
8637
14019
3323
10045
6877
9228
8467
6781
7516
12774
17170
9156
5095
4064
16641
8840
6276
7892
8619
13600
14201
8134
2935
10574
15010
6433
9522
11490
6613
1532
5721
14409
19350
6386
2997
7668
17228
8755
10076
14601
3972
8953
3839
5235
7822
15860
9355
10533
16585
10953
9667
5874
10599
8663
12618
19016
6440
12037
5870
5768
12659
15447
3057
10650
12038
9485
6929
6562
11230
10634
14796
9762
13542
13935
11682
7502
8098
13224
12079
2127
12763
9648
16631
9020
15107
13672
10481
10243
3007
9569
4021
12078
10914
8951
8232
16747
24066
2929
5842
4760
10521
12028
10317
7966
17893
13827
1848
10363
22370
1604
7404
15570
7439
7571
7697
10060
12910
5950
17165
13020
17643
8261
11912
14327
16312
18423
21865
10712
7157
4968
12847
15183
8124
11860
13457
3858
12236
6773
6978
15103
9105
11023
4087
18432
14030
11107
8233
6249
11752
14227
14758
24660
11011
5723
2732
2457
11087
7680
6134
17079
8196
5804
2341
7926
14682
10814
7210
14156
18485
15600
16685
1838
9420
14129
14745
16807
9765
14865
8836
9537
15405
18760
6035
9308
5396
13153
4558
22277
7206
10184
9666
19040
13115
18527
17629
2162
17752
3618
11734
5975
15230
8450
14472
5303
12460
11955
19089
11626
6609
2575
7587
7117
12059
8132
6026
11344
9163
3699
15908
10922
6315
6508
15802
928
5425
15217
11465
7973
10918
13414
6639
1058
6670
22185
13240
9188
10666
16188
9405
10631
2610
17129
17445
7696
9466
5738
16941
9398
9111
4465
13766
8237
10808
8890
12161
12790
12596
10175
15087
2257
6212
9219
6470
18421
8872
4630
14774
2566
4656
11174
13510
6346
10162
7384
14605
17505
15706
8687
9539
9552
9923
10458
13145
11187
10558
3722
10424
17807
9916
14013
11177
14343
10603
9523
4544
18250
5356
17168
16035
3425
4631
16946
8111
3107
10018
8650
20620
11474
5240
12372
9562
7523
2783
7488
17174
14102
10550
11534
10630
13597
7420
17358
8868
6532
6424
10474
9812
13005
7306
1358
10698
16769
6979
4552
10825
8182
4967
9078
11741
16032
17343
3042
8610
15596
3355
9122
1450
11859
6397
15128
13635
11685
5510
3558
4133
9726
3947
17834
8323
15500
15898
17535
2700
8679
6953
12677
7437
6616
16144
4506
9311
16610
14062
6694
8671
11020
8094
6640
4925
3403
7629
11078
17147
16254
13731
6865
8811
13717
6454
8599
7816
7536
9054
16083
8053
6550
8891
12780
1139
8756
13368
9165
12887
12985
21376
11812
5080
2776
5395
10936
12585
7534
4902
6587
20872
2722
11780
13592
5299
7431
5736
13149
8120
28061
10944
10546
15226
8645
11806
11070
19877
18924
11185
12314
8527
15388
12998
13282
10150
14094
6042
5223
7609
5823
10723
4365
15597
15383
3593
6992
11495
22583
13736
11799
7751
4604
14546
14624
7167
11391
15506
7637
10089
9209
11582
9173
11516
7848
15891
18369
3052
12513
12255
17102
7603
8495
11756
13676
11300
1664
16315
10403
11703
16731
5623
15670
2980
8227
12644
2914
8685
13574
10798
11231
5920
14338
10039
10880
16682
15320
13002
8386
13623
10562
16108
6114
16165
22299
22306
5477
18275
4458
11035
7532
16371
13215
13044
13699
10535
10142
19742
15818
15386
4297
15127
15277
12736
14613
11360
11062
10916
8414
3846
4678
4348
11758
15114
17130
17877
9596
12968
12537
4263
10781
5864
9521
887
4224
5833
1190
3085
6958
5443
12158
4164
13994
17691
9800
14575
12379
3388
10624
13589
11631
6902
11301
11063
11422
17115
13622
14141
2665
18912
2976
9960
5746
6028
9349
18578
7800
22860
5077
13152
441
10158
14216
9967
7719
23460
21342
6879
13716
4942
7529
16653
12757
17755
4243
9721
15294
3525
14021
15023
7220
4211
10099
5628
14135
7228
8383
8947
2004
14492
26877
14237
979
10512
6743
16268
2543
2216
17132
9621
7662
6924
6407
5636
15002
8966
12591
12359
8486
6034
14627
4345
14596
3624
4970
4873
19491
8268
10204
2623
3230
9321
13754
3588
1834
9565
11634
11376
2003
1196
9675
16225
10310
7812
6125
6094
19671
11236
11983
8441
5183
10340
10435
21109
13984
6937
12386
14313
1844
6733
8988
11676
6439
7845
14634
7381
16758
5653
7035
17601
8168
3297
13764
5616
9385
8561
6832
4139
5556
19049
12944
4069
3339
10255
11098
5641
8510
26865
24397
2109
9411
15869
6073
8119
15548
7682
6860
15817
16419
13866
14037
8665
2583
8085
8150
21428
7411
29404
11451
9382
2081
12953
16417
10976
14522
8712
10778
8873
7512
12066
16528
19458
15494
6254
7530
14660
10787
6019
15964
11563
8919
5211
7541
12309
8042
10902
6511
5264
14510
6398
13521
13164
21233
17711
9581
7510
10773
1603
593
4736
2307
9220
11324
12220
10092
10962
18438
7427
13663
2396
13442
11655
16900
8693
6751
15978
10002
23752
14024
1240
6746
4538
10729
3169
4444
16212
7232
4353
11310
15457
7864
12568
11135
13549
7414
13122
19036
9265
3259
18631
12897
14213
7354
10001
15427
22523
12754
20421
427
17293
16651
13067
6908
14560
4027
2491
12006
20940
36797
14529
1819
11275
12901
7508
12775
12866
4595
22239
3564
1088
8810
4832
14208
12257
8628
13146
1645
11642
18207
16568
17028
17097
9261
2108
13611
14483
11157
21076
9825
12263
8993
3397
15943
12606
8272
10087
9955
9608
10515
15940
15666
8822
7887
7944
11038
17514
4761
14083
15256
3070
12679
12134
14567
12624
10367
17265
8644
9070
13820
6872
5397
10863
12619
1851
11750
15848
12675
10072
16987
4185
13778
15090
9704
14233
15938
6586
13272
10464
3476
9024
4122
2009
8759
6209
9298
9992
10012
13194
9478
15000
9077
6378
13639
10927
2385
12151
884
25200
11075
9194
16086
18481
7678
7171
6436
6874
15639
12804
3982
11707
15242
17722
8335
13486
13757
14404
5660
17302
21098
17660
5800
4700
11551
10041
13458
17408
9613
13836
10071
10468
13011
17155
1408
14242
13271
9593
11643
12506
10748
7819
16002
9247
9252
7052
9004
10332
3961
9665
14439
16766
12909
13342
11677
20373
7932
7782
11807
11319
13387
10511
20680
1320
14765
4754
8936
4965
12308
10983
14832
19037
6084
8314
3086
4752
10923
11796
12592
3376
5230
13003
17639
15829
14769
23038
8542
8816
12012
11600
9488
7363
5882
15223
12114
16245
18343
15590
15569
12223
9396
15547
7739
6227
7461
12118
8967
18101
7873
2799
12026
5544
7646
7717
8407
9822
7881
12652
15990
13962
17193
14815
10620
13009
4969
11031
5539
15831
16545
5448
18212
17895
4045
5888
10867
10837
12333
7862
6713
11571
10477
6152
5610
14814
14989
6706
9655
3631
8785
6367
5376
5655
21618
8160
6537
16581
14676
1647
14933
27252
4225
4189
10937
11713
3659
15265
13913
10490
10276
11652
11793
4396
3097
9148
14747
14523
2590
1333
17599
9179
10456
15241
398
8239
1923
6041
3880
16237
7952
12561
8795
6185
10828
5650
18659
12291
9584
8209
13655
11057
15787
9728
14961
16756
7054
8748
12127
11047
12570
6635
16184
13371
9438
17037
17380
17404
6318
10632
8080
13979
13982
15185
17549
17610
15621
19806
6973
8539
7376
5961
12040
7884
12983
13770
7645
4118
27402
11223
12522
8350
1081
5217
8497
14884
7863
6886
15268
11958
18285
16837
18264
11429
12992
6964
7178
14903
14898
13014
16259
26976
12340
12798
8514
12610
1538
7553
17833
12377
16497
14266
15614
11856
7089
8626
23905
3896
6253
4312
8140
7217
15589
8473
10702
20169
12900
13218
13673
5135
4375
15993
12664
14861
13734
15413
16445
17590
5199
11032
15341
15437
10277
17240
12244
13883
9536
7591
2151
9576
22752
16872
12160
13300
4218
4278
18316
17577
21005
9753
10952
5540
13269
4896
5892
8720
7356
13040
10793
16779
13287
4802
13848
14913
10804
7569
18226
12772
16279
14098
15809
14838
12792
10810
10467
7181
17218
7109
15472
10676
15712
15438
9432
19418
15580
9802
10933
17175
17664
3407
16674
2413
7712
19088
11625
14252
14017
1768
10973
5177
18475
14777
8184
11312
9121
9325
5108
12674
8824
14707
2420
6748
15264
8717
14742
13422
18115
10444
13326
13100
6688
13419
15395
14321
14305
12654
8388
9133
872
21785
7836
7202
15097
6298
17034
5102
6272
10368
11089
12769
8856
12363
13320
9793
2875
14050
16733
2881
8677
6824
3383
11759
17559
13884
7760
9717
14143
13094
19387
17282
9517
13365
8057
6849
12290
17242
6740
3179
13207
15920
10913
16711
15027
11166
21074
16789
16270
11256
12219
3478
9412
2966
6867
10374
16013
2256
830
4031
15874
14241
18913
6624
6169
514
11748
8026
8351
14070
17356
6985
7602
8945
12844
9203
24876
10129
8235
11486
7594
4011
19481
5576
9673
6352
6922
13396
10697
16049
25540
3557
12639
14162
9383
4279
8933
15553
2949
8481
10443
13196
8423
9257
12303
2447
17746
6411
9921
14323
14495
17942
9582
20927
3481
15816
14928
4644
14240
17583
5493
15466
14614
14671
11033
6342
16824
17426
5353
13968
8984
4599
18460
12217
7705
13927
9386
8212
8913
16437
12702
11056
11343
2721
6494
15696
5769
7154
16308
11651
13275
2531
8915
12224
13293
10469
14826
13579
5159
17686
17943
13062
10156
2728
11284
7912
15353
15287
7212
12168
14665
5503
24642
15062
9622
4688
16178
6204
11219
15823
8522
13615
6186
16519
7939
4459
14128
9441
